[AdventShieldbearerArmor X2ArmorTemplate]
FriendlyName="Броня щитоносца Адвента"
FriendlyNamePlural="Броня щитоносцец Адвента"
BriefSummary="Броня щитоносца оснащена портативным генератором аблативного поля, позволяющего генерировать матрицу защитного поля на союзниках в довольно большом радиусе. Теперь и мы можем пользоваться этой технологией!"
TacticalText="Броня щитоносца оснащена портативным генератором аблативного поля, позволяющего генерировать матрицу защитного поля на союзниках в довольно большом радиусе. Теперь и мы можем пользоваться этой технологией!"


[AdventShieldbearerArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Обман"
LocLongDescription="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocHelpText="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocFlyOverText="Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"
LocPromotionPopupText="<Bullet/> Солдат одетый в броню врага лучше проникает на миссии, а его радиус обнаружения меньше на 25%"


[AdventShieldbearerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Тяжелая защита"
LocLongDescription="Броня щитоносца Адвента оснащена дополнительной броней и имеет встроенный генератор щита"
LocHelpText="Броня щитоносца Адвента оснащена дополнительной броней и имеет встроенный генератор щита"
LocFlyOverText="Броня щитоносца Адвента оснащена дополнительной броней и имеет встроенный генератор щита"
LocPromotionPopupText="<Bullet/> Броня щитоносца Адвента оснащена дополнительной броней и имеет встроенный генератор щита"


